---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.BtuPerHFtSup2DegreeF
source: html/b0f800c2-617e-f847-bec2-1d707fa81606.htm
---
# Autodesk.Revit.DB.SymbolTypeId.BtuPerHFtSup2DegreeF Property

Symbol BTU/(h·ft²·°F), indicating unit British thermal units per hour square foot degree Fahrenheit.

## Syntax (C#)
```csharp
public static ForgeTypeId BtuPerHFtSup2DegreeF { get; }
```